''' ДОПОЛНИТЕЛЬНАЯ задача на алгоритмы с реальных собеседований.
    Даны два массива:
        [1, 2, 3, 2, 0] и [5, 1, 2, 7, 3, 2]
    Надо вернуть их пересечение [1, 2, 2, 3] (порядок не важен)
'''
arr1 = [1, 2, 3, 2, 0]
arr2= [5, 1, 2, 7, 3, 2]

print(f'Массив 1: {arr1}')
print(f'Массив 2: {arr2}')

if arr1 > arr2:
    arr1, arr2 = arr2, arr1

arr = []
for i in range(len(arr1)):
    for j in range(len(arr2)):
        if arr1[i] == arr2[j]:
            arr.append(arr1[i])
            arr2[j] = '_'
            break
print(f'Пересечение двух массивов: {arr}')
