''' Task16. Задайте список из n чисел последовательности (1 + 1/n)**n и выведите на экран их сумму.
    Пример:
        Для n = 6: {1: 2.0, 2: 2.25, 3: 2.37, 4: 2.44, 5: 2.49, 6: 2.52}
            Сумма=  14.07

        Для n = 4: {1: 2, 2: 2.25, 3: 2.37, 4: 2.44}
            Сумма 9.06.
'''

num = int(input('Введите целое число: '))
dict_list = {}
summ = 0
for i in range(1, num + 1):
    temp = (1 + 1/i)**i
    dict_list[i] = round(temp, 2)
    summ += temp
print(dict_list)
print('Сумма= ', round(summ, 2))
